public class Main {
    public static void main(String[] args) {

        /**
         *  Цикл while
         *
         *  (с предусловием)
         *  while (<условие>) {
         *      <операторы>
         *  }
         *
         *  (с постусловием)
         *  do {
         *      <операторы>
         *  } while(<условие>);
         *
         *  Разница в том, что в цикле с постусловием тело цикла выполнится хотя бы один раз.
         *
         *  Важно, чтобы внутри цикла изменялась какая-либо переменная из условия.
         *  Иначе есть вероятность, что цикл может не закончиться.
         *  Цикл while чаще используется, если заранее неизвестно кол-во итераций цикла.
         *
         *  Операторы, нарущающие естественное поведение цикла:
         *  break    - заканчивает цикл, в котором находится
         *  continue - пропускает операторы, стоящие за ним внутри цикла. Цикл переходит к следующей итерации.
         */
    }
}