## Строки
Строка - это последовательность символов, заключенных в двойные кавычки.

В Java для работы со строками определён класс <code>String</code>.

> Строки в Java неизменяемы (immutable), т.е. методы возвращают новую изменённую строку.

### Методы класса String

> <code>length()</code>\
> Возвращает длину строки

> <code>toUpperCase()</code>\
> Возвращает строку в верхнем регистре.

> <code>toLowerCase()</code>\
> Возвращает строку в нижнем регистре.

> <code>charAt(индекс)</code>\
> Возвращает символ, находящийся в позиции <code>индекс</code>

> <code>indexOf(строка, [начало_поиска])</code>\
> 


---

**Задача "Замена a-b"**\
Напишите программу, которая заменяет в символьной строке все буквы a на буквы b (латинские, строчные).\

**Входные данные**\
Входная строка содержит символы латинского алфавита, как строчные, так и заглавные.

**Выходные данные**\
Программа должна заменить во всей строке строчные буквы a на буквы b и вывести в первой строке получившуюся символьную строку, а во второй – количество выполненных замен.
```Java
import java.util.Scanner;
public class Main {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        String str = input.nextLine();
        String res = "";
        int sum=0;
        for (int i = 0; i < str.length(); i++) {
            if ('a' == str.charAt(i)) {
                res += 'b';
                sum++;
            } else res += str.charAt(i);
        }
        System.out.println(res);
        System.out.println(sum);
    }
}
```



