public class Main {
    public static void main(String[] args) {
        /**
         * Тернарный оператор
         *
         * <условие> ? <оператор 1> : <оператор 2>;
         *
         * Тернарный оператор возвращает значение!!!!!
         *
         * Используется, как замена if, в котором происходит присваивание значения переменной в зависимости от условия.
         * Пример:
         * Поиск максимасльного числа
         * if (a > b) {
         *      max = a;
         * }
         * else {
         *      max = b;
         * }
         * Весь этот код можно заменить на один тернарный оператор:
         * max = a > b ? a : b;
         *
         */
    }
}