public class Main {
    public static void main(String[] args) {
        /**
         *  Цикл for
         *  for ([1]; [2]; [3]) {
         *      <операторы>
         *  }
         *  *1 - создание и инициализация переменных цикла
         *  *2 - условие (пока условие истино, цикл выполняется)
         *  *3 - действия с переменными цикла
         *  Все части цикла необязательны.
         *  Чаще всего цикл for применяют в задачах, где заранее известно кол-во итераций цикла.
         */

        for (int i = 0; i < 10; i++) {
            System.out.printf("%d ", i);
        }

    }
}